comment.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="16" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="6" duration="35" unit="second">
     <users arrivalrate="20" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="7" duration="35" unit="second">
     <users arrivalrate="40" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="8" duration="35" unit="second">
     <users arrivalrate="80" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="9" duration="35" unit="second">
     <users arrivalrate="100" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="10" duration="35" unit="second">
     <users arrivalrate="120" unit="second"/>
   </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    
    <session name="comment-a-note-unit-test" probability="30" type="ts_http">

      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="username"/>
      </setdynvars>

      <request>
        <http url="/users/sign_in" version="1.1" method="GET"/>
      </request>

      <request subst="true">
        <http url="/users/sign_in" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;user%5Bemail%5D=yuexin%40umail.ucsb.edu&amp;user%5Bpassword%5D=77777777&amp;user%5Bremember_me%5D=0&amp;commit=Log+in">
        </http>
      </request>


      <request subst="true">
        <http url="/search" version="1.1" method="POST" contents="utf8=%E2%9C%93&authenticity_token=NsQZMlugWOeg0KeXH%2FbvX7NOsnSIZjizi02Lw%2B4h%2FyViIDiPfvcKDZ%2BJGih77UeEx6rxA%2F%2B4d5%2FvPYCFi0qRJg%3D%3D&search=hey&commit=Search"/>
      </request>

      <request subst="true"> 
        <http url="/notes/74" version="1.1" method="GET"/>
      </request>


      <request subst="true">
        <http url="/comments" version="1.1" method="POST" contents="utf8=%E2%9C%93&authenticity_token=%2BJrHAKwccpsh6gAAXF4UmNv6M3tgk5gPVuLEwzw5zmusfua9iUsgcR6zvb84RbxDrx5wDBdN1yMyks%2BFWVKgaA%3D%3D&note_id=75&comment%5Bcontent%5D=hey&commit=Post+comment"/>

      </request>

      <request>
        <http url="/static_pages/home" version="1.1" method="GET"/>
      </request>

      <request>
        <http url="/users/sign_out" version="1.1" method="POST" contents="_method=delete&amp;"/>
      </request> 

    </session> 
  </sessions>
</tsung>